STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Inc/stm32mp2xx_hal_rcc_valid.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_rcc.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL module.
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    HAL RCC RIF driver contains a set of following user APIs :
      (+) API to set and get configuration of Security/Privilege/(Static or Dynamic) CID access filtering to RCC Local Resources
      (+) API to take and release semaphore used for Dynamic CID access to RCC Local Resources

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2021 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/**
  * @brief This HAL is based on following reference documents :
  *
  *        - "Panther_RCC (Reset and Clock Control) SOC IP user specification"
  *           Revision 1.0.25 - January 15th, 2021
  *          (file c8amba_rcc_UserSpec_Panther_1_0_25.pdf)
  *
  *        File has been organised in the following order :
  *        - clocks management
  *        - resets management
  *        - interrupts management
  */

/* Define to prevent recursive inclusion */
#ifndef __STM32MP2xx_HAL_RCC_H
#define __STM32MP2xx_HAL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes */
#include "stm32mp2xx_ll_rcc.h"
#include "stm32mp2xx_hal_def.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/******************************************************************************
  * Clock frequency measurement
  ******************************************************************************/
#define APPLY_BZ121873 /* see BZ 121873 description */

/******************************************************************************
  * CLOCKS management
  ******************************************************************************/

/* Clocks identifiers list (see [RCC_Spec] "Table 16." and "Table 20.")
   Note: the following construction allows
         to easily generate strings for clock names if required */
#if ! defined(STM32MP2XX_ASSY3_1_0)

#define ALL_CLOCK_IDS(CLKID) \
  CLKID(RCC_CK_NONE) \
  /* Oscillators: managed with \
     - HAL_RCC_SetOscCfg()
     - HAL_RCC_GetOscCfg() */ \
  CLKID(RCC_CK_LSI) /* ID 1 */ \
  CLKID(RCC_CK_LSE) \
  CLKID(RCC_CK_CSI) \
  CLKID(RCC_CK_HSE) \
  CLKID(RCC_CK_HSI) \
  CLKID(RCC_CK_CSI_KER) \
  CLKID(RCC_CK_HSE_KER) \
  CLKID(RCC_CK_HSI_KER) \
  /* PLL4 to 8 ref clocks, then 1 to 3 \
     Note: index order */ \
  CLKID(RCC_CK_PLL4REF) /* ID 9 = MUXSEL0 to GFG0/PLL4 */ \
  CLKID(RCC_CK_PLL5REF) /* MUXSEL1 to GFG1/PLL5 */ \
  CLKID(RCC_CK_PLL6REF) /* MUXSEL2 to GFG2/PLL6 */ \
  CLKID(RCC_CK_PLL7REF) /* MUXSEL3 to GFG3/PLL7 */ \
  CLKID(RCC_CK_PLL8REF) /* MUXSEL4 to GFG4/PLL8 */ \
  CLKID(RCC_CK_PLL1REF) /* MUXSEL5 to CA35 PLL */ \
  CLKID(RCC_CK_PLL2REF) /* MUXSEL6 to DDR PLL */ \
  CLKID(RCC_CK_PLL3REF) /* MUXSEL7 to GPU PLL */ \
  /* RCC external PLLs */ \
  CLKID(RCC_CK_PLL1) /* ID 17 = CA35 PLL output */ \
  CLKID(RCC_CK_PLL2) /* DDR PLL output */ \
  CLKID(RCC_CK_PLL3) /* GPU PLL output */ \
  /* Flexiclockgen GFGs/PLLs outputs in GFG number order */ \
  CLKID(RCC_CK_PLL4) /* ID 20 = GFG0 */ \
  CLKID(RCC_CK_PLL5) \
  CLKID(RCC_CK_PLL6) \
  CLKID(RCC_CK_PLL7) \
  CLKID(RCC_CK_PLL8) /* GFG4 */ \
  /* Flexiclockgen outputs (in channel order). \
     Managed with
     - HAL_RCC_SetClockCfg()
     - HAL_RCC_GetClockCfg() */ \
  CLKID(RCC_CK_ICN_MCU)     /* ID 25 [channel 0] ck_icn_hs_mcu, ck_icn_ls_mcu */ \
  CLKID(RCC_CK_ICN_SDMMC)   /* ck_icn_p_dlybsd1, ck_icn_p_dlybsd2, ck_icn_p_dlybsd3, \
                                 ck_icn_m_sdmmc1, ck_icn_m_sdmmc2, ck_icn_m_sdmmc3 */ \
  CLKID(RCC_CK_ICN_DDR)     /* ck_icn_s_ddr1, ck_icn_s_ddr2, ck_icn_m_cpu1 */ \
  CLKID(RCC_CK_ICN_DISPLAY) /* ck_icn_m_ltdc, ck_icn_m_dcmipp */ \
  CLKID(RCC_CK_ICN_HSL)     /* ck_icn_m_pcie, ck_icn_m_usb3drd, ck_icn_m_usb2ehci, \
                                 ck_icn_m_usb2ohci, ck_icn_m_eth1, ck_icn_m_eth2 */ \
  CLKID(RCC_CK_ICN_NIC)     /* ck_icn_s_bootrom, ck_icn_s_gic400 */ \
  CLKID(RCC_CK_ICN_VID)     /* ck_icn_m_vdec, ck_icn_m_venc */ \
  CLKID(RCC_CK_KER_LPTIM12)    /* ck_ker_lptim1, ck_ker_lptim2 */ \
  CLKID(RCC_CK_KER_USART24)    /* ck_ker_usart2, ck_ker_usart4 */ \
  CLKID(RCC_CK_KER_USART35)    /* ck_ker_usart3, ck_ker_usart5 */ \
  CLKID(RCC_CK_KER_SPI23)      /* [channel 10] ck_ker_spi2, ck_ker_spi3 */ \
  CLKID(RCC_CK_KER_SPDIFRX) \
  CLKID(RCC_CK_KER_I2C12I3C12) /* ck_ker_i2c1, ck_ker_i2c2, ck_ker_i3c1, ck_ker_i3c2 */ \
  CLKID(RCC_CK_KER_I2C35I3C3)  /* ck_ker_i2c3, ck_ker_i2c5, ck_ker_i3c3 */ \
  CLKID(RCC_CK_KER_I2C46)      /* ck_ker_i2c4, ck_ker_i2c6 */ \
  CLKID(RCC_CK_KER_I2C7) \
  CLKID(RCC_CK_KER_SPI1) \
  CLKID(RCC_CK_KER_SPI45)      /* ck_ker_spi4, ck_ker_spi5 */ \
  CLKID(RCC_CK_KER_SPI67)      /* ck_ker_spi6, ck_ker_spi7 */ \
  CLKID(RCC_CK_KER_USART1) \
  CLKID(RCC_CK_KER_USART6)     /* [channel 20] */ \
  CLKID(RCC_CK_KER_UART78)     /* ck_ker_uart7, ck_ker_uart8 */ \
  CLKID(RCC_CK_KER_UART9) \
  CLKID(RCC_CK_KER_SAI1MDF1)   /* ck_ker_sai1, ck_ker_mdf1 */ \
  CLKID(RCC_CK_KER_SAI2) \
  CLKID(RCC_CK_KER_SAI34)      /* ck_ker_sai3, ck_ker_sai4 */ \
  CLKID(RCC_CK_KER_FDCAN)      /* ck_ker_fdcan */ \
  CLKID(RCC_CK_KER_DSIBLANE)   /* ck_ker_dsilane (DSI lanebyte or pixel clock) */ \
  CLKID(RCC_CK_KER_DSIPHY) \
  CLKID(RCC_CK_KER_CSI2)       /* ck_ker_csi2 (DCMIPP + CSI2HOST) */ \
  CLKID(RCC_CK_KER_CSI2TXESC)  /* [channel 30] */ \
  CLKID(RCC_CK_KER_CSI2PHY) \
  CLKID(RCC_CK_KER_LVDSPHY) \
  CLKID(RCC_CK_KER_STGEN) \
  CLKID(RCC_CK_KER_USB3PCIEPHY) \
  CLKID(RCC_CK_KER_UCPD1) \
  CLKID(RCC_CK_KER_I3C4) \
  CLKID(RCC_CK_KER_SPI8) \
  CLKID(RCC_CK_KER_I2C8) \
  CLKID(RCC_CK_KER_LPUART1) \
  CLKID(RCC_CK_KER_LPTIM3)     /* [channel 40] */ \
  CLKID(RCC_CK_KER_LPTIM45)    /* ck_ker_lptim4, ck_ker_lptim5 */ \
  CLKID(RCC_CK_KER_ADF1) \
  CLKID(RCC_CK_KER_TSDBG) \
  CLKID(RCC_CK_KER_TPIU) \
  CLKID(RCC_CK_SYS_ATB)        /* ck_sys_atb, ck_icn_m_etr */ \
  CLKID(RCC_CK_KER_ADC12) \
  CLKID(RCC_CK_KER_ADC3) \
  CLKID(RCC_CK_KER_OSPI1) \
  CLKID(RCC_CK_KER_OSPI2) \
  CLKID(RCC_CK_KER_FMC)        /* [channel 50] */ \
  CLKID(RCC_CK_KER_SDMMC1) \
  CLKID(RCC_CK_KER_SDMMC2) \
  CLKID(RCC_CK_KER_SDMMC3) \
  CLKID(RCC_CK_KER_ETH1_ETHSW) /* ck_ker_eth1, ck_ker_ethsw */ \
  CLKID(RCC_CK_KER_ETH2) \
  CLKID(RCC_CK_KER_ETHPTP)     /* ck_ker_eth1_ptp, ck_ker_eth2_ptp */ \
  CLKID(RCC_CK_KER_USB2PHY1) \
  CLKID(RCC_CK_KER_USB2PHY2) \
  CLKID(RCC_CK_ICN_M_GPU) \
  CLKID(RCC_CK_KER_ETHSWREF)   /* [channel 60] */ \
  CLKID(RCC_CK_MCO1)           /* Flexgen output. Not MCO1 pad */ \
  CLKID(RCC_CK_MCO2)           /* Flexgen output. Not MCO2 pad */ \
  CLKID(RCC_CK_CPU1EXT2F)      /* CA35 EXT2F clock */ \
  /* Internal bus clocks. \
     Managed with
     - HAL_RCC_SetClockCfg()
     - HAL_RCC_GetClockCfg() */ \
  CLKID(RCC_CK_ICN_APB1)   /* Sourced from RCC_CK_LS_ICN_MCU */ \
  CLKID(RCC_CK_ICN_APB2)   /* Sourced from RCC_CK_LS_ICN_MCU */ \
  CLKID(RCC_CK_ICN_APB3)   /* Sourced from RCC_CK_LS_ICN_MCU */ \
  CLKID(RCC_CK_ICN_APB4)   /* Sourced from RCC_CK_LS_ICN_MCU */ \
  CLKID(RCC_CK_ICN_APBDBG) /* Sourced from RCC_CK_LS_ICN_MCU */ \
  /* Misc. \
     Managed with
     - HAL_RCC_SetClockCfg()
     - HAL_RCC_GetClockCfg() */ \
  CLKID(RCC_CK_RTC)  /* ck_ker_rtc (RTC/AWU) */ \
  CLKID(RCC_CK_SPDIF) \
  CLKID(RCC_CK_I2S) \
  CLKID(RCC_CK_OBS0) /* Obs clock 0 from flexiclockgen */ \
  CLKID(RCC_CK_OBS1) /* Obs clock 1 from flexiclockgen */ \
  /* CLKID(RCC_CK_TEMP) : ck_ker_tmpsens ? */ \
  CLKID(RCC_CK_LAST) /* Always keep this last marker, AND LET NEXT LINE BLANK !!! */ \

#else /* ! defined(STM32MP2XX_ASSY3_1_0) */

#define ALL_CLOCK_IDS(CLKID) \
  CLKID(RCC_CK_NONE) \
  /* Oscillators: managed with \
     - HAL_RCC_SetOscCfg()
     - HAL_RCC_GetOscCfg() */ \
  CLKID(RCC_CK_LSI) /* ID 1 */ \
  CLKID(RCC_CK_LSE) \
  CLKID(RCC_CK_CSI) \
  CLKID(RCC_CK_HSE) \
  CLKID(RCC_CK_HSI) \
  CLKID(RCC_CK_CSI_KER) \
  CLKID(RCC_CK_HSE_KER) \
  CLKID(RCC_CK_HSI_KER) \
  /* PLL4 to 8 ref clocks, then 1 to 3 \
     Note: index order */ \
  CLKID(RCC_CK_PLL4REF) /* ID 9 = MUXSEL0 to GFG0/PLL4 */ \
  CLKID(RCC_CK_PLL5REF) /* MUXSEL1 to GFG1/PLL5 */ \
  CLKID(RCC_CK_PLL6REF) /* MUXSEL2 to GFG2/PLL6 */ \
  CLKID(RCC_CK_PLL7REF) /* MUXSEL3 to GFG3/PLL7 */ \
  CLKID(RCC_CK_PLL8REF) /* MUXSEL4 to GFG4/PLL8 */ \
  CLKID(RCC_CK_PLL1REF) /* MUXSEL5 to CA35 PLL */ \
  CLKID(RCC_CK_PLL2REF) /* MUXSEL6 to DDR PLL */ \
  CLKID(RCC_CK_PLL3REF) /* MUXSEL7 to GPU PLL */ \
  /* RCC external PLLs */ \
  CLKID(RCC_CK_PLL1) /* ID 17 = CA35 PLL output */ \
  CLKID(RCC_CK_PLL2) /* DDR PLL output */ \
  CLKID(RCC_CK_PLL3) /* GPU PLL output */ \
  /* Flexiclockgen GFGs/PLLs outputs in GFG number order */ \
  CLKID(RCC_CK_PLL4) /* ID 20 = GFG0 */ \
  CLKID(RCC_CK_PLL5) \
  CLKID(RCC_CK_PLL6) \
  CLKID(RCC_CK_PLL7) \
  CLKID(RCC_CK_PLL8) /* GFG4 */ \
  /* Flexiclockgen outputs (in channel order). \
     Managed with
     - HAL_RCC_SetClockCfg()
     - HAL_RCC_GetClockCfg() */ \
  CLKID(RCC_CK_ICN_MCU)     /* ID 25 [channel 0] ck_icn_hs_mcu, ck_icn_ls_mcu */ \
  CLKID(RCC_CK_ICN_SDMMC)   /* ck_icn_p_dlybsd1, ck_icn_p_dlybsd2, ck_icn_p_dlybsd3, \
                                 ck_icn_m_sdmmc1, ck_icn_m_sdmmc2, ck_icn_m_sdmmc3 */ \
  CLKID(RCC_CK_ICN_DDR)     /* ck_icn_s_ddr1, ck_icn_s_ddr2, ck_icn_m_cpu1 */ \
  CLKID(RCC_CK_ICN_DISPLAY) /* ck_icn_m_ltdc, ck_icn_m_dcmipp */ \
  CLKID(RCC_CK_ICN_HSL)     /* ck_icn_m_pcie, ck_icn_m_usb3drd, ck_icn_m_usb2ehci, \
                                 ck_icn_m_usb2ohci, ck_icn_m_eth1, ck_icn_m_eth2 */ \
  CLKID(RCC_CK_ICN_NIC)     /* ck_icn_s_bootrom, ck_icn_s_gic400 */ \
  CLKID(RCC_CK_ICN_VID)     /* ck_icn_m_vdec, ck_icn_m_venc */ \
  CLKID(RCC_CK_KER_LPTIM12)    /* ck_ker_lptim1, ck_ker_lptim2 */ \
  CLKID(RCC_CK_KER_USART24)    /* ck_ker_usart2, ck_ker_usart4 */ \
  CLKID(RCC_CK_KER_USART35)    /* ck_ker_usart3, ck_ker_usart5 */ \
  CLKID(RCC_CK_KER_SPI23)      /* [channel 10] ck_ker_spi2, ck_ker_spi3 */ \
  CLKID(RCC_CK_KER_SPDIFRX) \
  CLKID(RCC_CK_KER_I2C12I3C12) /* ck_ker_i2c1, ck_ker_i2c2, ck_ker_i3c1, ck_ker_i3c2 */ \
  CLKID(RCC_CK_KER_I2C35I3C3)  /* ck_ker_i2c3, ck_ker_i2c5, ck_ker_i3c3 */ \
  CLKID(RCC_CK_KER_I2C46)      /* ck_ker_i2c4, ck_ker_i2c6 */ \
  CLKID(RCC_CK_KER_I2C7) \
  CLKID(RCC_CK_KER_SPI1) \
  CLKID(RCC_CK_KER_SPI45)      /* ck_ker_spi4, ck_ker_spi5 */ \
  CLKID(RCC_CK_KER_SPI67)      /* ck_ker_spi6, ck_ker_spi7 */ \
  CLKID(RCC_CK_KER_USART1) \
  CLKID(RCC_CK_KER_USART6)     /* [channel 20] */ \
  CLKID(RCC_CK_KER_UART78)     /* ck_ker_uart7, ck_ker_uart8 */ \
  CLKID(RCC_CK_KER_UART9) \
  CLKID(RCC_CK_KER_SAI1MDF1)   /* ck_ker_sai1, ck_ker_mdf1 */ \
  CLKID(RCC_CK_KER_SAI2) \
  CLKID(RCC_CK_KER_SAI34)      /* ck_ker_sai3, ck_ker_sai4 */ \
  CLKID(RCC_CK_KER_FDCAN)      /* ck_ker_fdcan */ \
  CLKID(RCC_CK_KER_DSIBLANE)   /* ck_ker_dsilane (DSI lanebyte or pixel clock) */ \
  CLKID(RCC_CK_KER_DSIPHY) \
  CLKID(RCC_CK_KER_CSI2)       /* ck_ker_csi2 (DCMIPP + CSI2HOST) */ \
  CLKID(RCC_CK_KER_CSI2TXESC)  /* [channel 30] */ \
  CLKID(RCC_CK_KER_CSI2PHY) \
  CLKID(RCC_CK_KER_LVDSPHY) \
  CLKID(RCC_CK_KER_STGEN) \
  CLKID(RCC_CK_KER_USB3PCIEPHY) \
  CLKID(RCC_CK_KER_UCPD1) \
  CLKID(RCC_CK_KER_I3C4) \
  CLKID(RCC_CK_KER_SPI8) \
  CLKID(RCC_CK_KER_I2C8) \
  CLKID(RCC_CK_KER_LPUART1) \
  CLKID(RCC_CK_KER_LPTIM3)     /* [channel 40] */ \
  CLKID(RCC_CK_KER_LPTIM45)    /* ck_ker_lptim4, ck_ker_lptim5 */ \
  CLKID(RCC_CK_KER_MDF2) \
  CLKID(RCC_CK_KER_TSDBG) \
  CLKID(RCC_CK_KER_TPIU) \
  CLKID(RCC_CK_SYS_ATB)        /* ck_sys_atb, ck_icn_m_etr */ \
  CLKID(RCC_CK_KER_ADC12) \
  CLKID(RCC_CK_KER_ADC3) \
  CLKID(RCC_CK_KER_OSPI1) \
  CLKID(RCC_CK_KER_OSPI2) \
  CLKID(RCC_CK_KER_FMC)        /* [channel 50] */ \
  CLKID(RCC_CK_KER_SDMMC1) \
  CLKID(RCC_CK_KER_SDMMC2) \
  CLKID(RCC_CK_KER_SDMMC3) \
  CLKID(RCC_CK_KER_ETH1_ETHSW) /* ck_ker_eth1, ck_ker_ethsw */ \
  CLKID(RCC_CK_KER_ETH2) \
  CLKID(RCC_CK_KER_ETHPTP)     /* ck_ker_eth1_ptp, ck_ker_eth2_ptp */ \
  CLKID(RCC_CK_KER_USB2PHY1) \
  CLKID(RCC_CK_KER_USB2PHY2) \
  CLKID(RCC_CK_ICN_M_GPU) \
  CLKID(RCC_CK_KER_ETHSWREF)   /* [channel 60] */ \
  CLKID(RCC_CK_MCO1)           /* Flexgen output. Not MCO1 pad */ \
  CLKID(RCC_CK_MCO2)           /* Flexgen output. Not MCO2 pad */ \
  CLKID(RCC_CK_CPU1EXT2F)      /* CA35 EXT2F clock */ \
  /* Internal bus clocks. \
     Managed with
     - HAL_RCC_SetClockCfg()
     - HAL_RCC_GetClockCfg() */ \
  CLKID(RCC_CK_ICN_APB1)   /* Sourced from RCC_CK_LS_ICN_MCU */ \
  CLKID(RCC_CK_ICN_APB2)   /* Sourced from RCC_CK_LS_ICN_MCU */ \
  CLKID(RCC_CK_ICN_APB3)   /* Sourced from RCC_CK_LS_ICN_MCU */ \
  CLKID(RCC_CK_ICN_APB4)   /* Sourced from RCC_CK_LS_ICN_MCU */ \
  CLKID(RCC_CK_ICN_APBDBG) /* Sourced from RCC_CK_LS_ICN_MCU */ \
  /* Misc. \
     Managed with
     - HAL_RCC_SetClockCfg()
     - HAL_RCC_GetClockCfg() */ \
  CLKID(RCC_CK_RTC)  /* ck_ker_rtc (RTC/AWU) */ \
  CLKID(RCC_CK_SPDIF) \
  CLKID(RCC_CK_I2S) \
  CLKID(RCC_CK_OBS0) /* Obs clock 0 from flexiclockgen */ \
  CLKID(RCC_CK_OBS1) /* Obs clock 1 from flexiclockgen */ \
  /* CLKID(RCC_CK_TEMP) : ck_ker_tmpsens ? */ \
  CLKID(RCC_CK_LAST) /* Always keep this last marker, AND LET NEXT LINE BLANK !!! */ \

#endif /* ! defined(STM32MP2XX_ASSY3_1_0) */

#define GENERATE_ENUM(ENUM) ENUM,

typedef enum HAL_RCC_ClockIds
{
  ALL_CLOCK_IDS(GENERATE_ENUM)
} RCC_ClockIdTypeDef;

/* For application who needs clock names (strings), the following
   code can be used

