STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Inc/stm32mp2xx_hal_rcc_valid.h
   #define GENERATE_STRING(STRING) #STRING,
   static const char *HAL_RCC_ClockNames[] = {
       ALL_CLOCK_IDS(GENERATE_STRING)
   };
  */

#define HSE_TIMEOUT_VALUE          HSE_STARTUP_TIMEOUT
#define HSI_TIMEOUT_VALUE          ((uint32_t)100)  /* 100 ms */
#define CSI_TIMEOUT_VALUE          ((uint32_t)100)  /* 100 ms */
#define PLL_TIMEOUT_VALUE          ((uint32_t)2)    /* PLL max lock time : 2 ticks stands for real value in range [1ms;2ms] */
#define LSI_TIMEOUT_VALUE          ((uint32_t)1)    /* 3 LSI cycles = 3/32K */
#define RCC_LSE_TIMEOUT_VALUE      ((uint32_t)200)  /* 4096 LSE cycles = 4096/32K */
#define CLOCKSWITCH_TIMEOUT_VALUE  ((uint32_t)1000) /* 1 s    */

enum
{
  RCC_OSCSTATE_UNDEF, // Undefined state
  RCC_OSCSTATE_OFF,
  RCC_OSCSTATE_ON,
  RCC_OSCSTATE_BYPASS, // ON + bypass
  RCC_OSCSTATE_DIGBYPASS, // ON + bypass + digital bypass
};

#define RCC_VALID_OSCSTATE(S) ((S == RCC_OSCSTATE_OFF) || (S == RCC_OSCSTATE_ON) || \
                               (S == RCC_OSCSTATE_BYPASS) || (S == RCC_OSCSTATE_DIGBYPASS))

#define RCC_OSCDRIVE_LOW        0 // !< LSE low drive
#define RCC_OSCDRIVE_MEDIUMLOW  1 // !< LSE medium low drive
#define RCC_OSCDRIVE_MEDIUMHIGH 2 // !< LSE medium high drive
#define RCC_OSCDRIVE_HIGH       3 // !< LSE highest drive

/* Oscillators config structure */
typedef struct
{
  uint16_t id; // Clock ID from @ref RCC_Clocks
  uint16_t state; //!< Oscillator state from @ref RCC_OSCSTATE_xxx
  uint32_t calibrationvalue;  /*!< The calibration trimming value.
                                      This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x3F */

  uint32_t divvalue; // Div value (for RCC_CK_CSI only)
  uint32_t drivevalue; // Drive value of @ref RCC_OSCDRIVE_xxx (for RCC_CK_LSE only)
} RCC_OscCfgTypeDef;

/** @brief  Macro to adjust the Internal High Speed oscillator (HSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __HSICalibrationValue__: specifies the calibration trimming value
  *         HSITRIM. HSITRIM represents a signed value. HSITRIM field is added
  *         to the engineering Option Bytes loaded during reset phase
  *         (bsec_hsi_cal[11:0]) in order to form the calibration trimming value.
  *         HSICAL[11:0] = bsec_hsi_cal[11:0] + HSITRIM[6:0]
  *         This parameter must be a number between 0 and 0x7F:
  *         0x40: bsec_hsi_cal[11:0] - 64
  *         0x41: bsec_hsi_cal[11:0] - 63
  *         ...
  *         0x0: bsec_hsi_cal[11:0] (default after reset)
  *         ...
  *         0x3E: bsec_hsi_cal[11:0] + 62
  *         0x3F: bsec_hsi_cal[11:0] + 63
  */
#define __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(__HSICalibrationValue__) \
  MODIFY_REG(RCC->HSICFGR, RCC_HSICFGR_HSITRIM, \
             (uint32_t)(__HSICalibrationValue__ & 0x7f) << RCC_HSICFGR_HSITRIM_Pos)

/** @brief  Macro Adjusts the Internal  oscillator (CSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal CSI RC.
  *         Please refer to the datasheet of the product for for more details on how to
  *         calibrate the CSI.
  * @param  __CSICalibrationValue__: specifies the calibration trimming value.
  *         This parameter must be a number between 0 and 0x1F.
  */
#define __HAL_RCC_CSI_CALIBRATIONVALUE_ADJUST(__CSICalibrationValue__) \
  MODIFY_REG(RCC->CSICFGR, RCC_CSICFGR_CSITRIM, \
             (uint32_t)(__CSICalibrationValue__) << RCC_CSICFGR_CSITRIM_Pos)

/* Possible PLL states (OR combination)
   Note: this coding is done so that value 0 means undefined.
   Note: 'bypass' can be selected whatever VCO enabled or not. */
#define RCC_PLLSTATE_ON     (1 << 0)    // PLL is ON
#define RCC_PLLSTATE_OFF    (1 << 1)    // PLL is OFF
#define RCC_PLLSTATE_BYPASS (1 << 2)    // VCO bypassed (clock coming from PLL input ref)

/* Possible PLL flags (OR combination)
 */
#define RCC_PLLFLAG_FRACTIONAL  (1 << 0) // flag[0]: 1=frac, 0=integer
#define RCC_PLLFLAG_DAC_ON      (1 << 1) // flag[1]=DACEN: 1=frac noise cancelling enabled, 0=disabled
#define RCC_PLLFLAG_SSCG_ON     (1 << 2) // flag[2]: 1=SSCG enabled, 0=disabled
#define RCC_PLLFLAG_SSCG_DOWN   (1 << 3) // flag[3]: 1=downspread, 0=center

/* PLLs config structure
   Suitable to handle PLLTS16FFCLAFRAC2 */
typedef struct
{
  uint16_t id;            // PLL output clock ID (RCC_CK_PLLx)
  uint16_t source;        // PLL ref clock ID
  uint8_t state;          // PLL state from @ref RCC_PLLSTATE_xxx
  uint8_t flags;          // OR combination of @ref RCC_PLLFLAG_xxx
  uint32_t frefdiv;       // FREFDIV[5:0]
  uint32_t fbdiv;         // FBDIV[11:0]
  uint32_t frac_in;       // FRACIN[23:0]
  uint32_t sscg_moddepth; // Modulation depth adjustment (SPREAD[4:0])
  uint32_t sscg_modfreq;  // Modulation frequency adjustment (DIVVAL[3:0])
  uint32_t postdiv1;      // FOUTPOSTDIV1 (from 1 to 7, 0=undef)
  uint32_t postdiv2;      // FOUTPOSTDIV2 (from 1 to 7, 0=undef)
} RCC_PLLCfgTypeDef;

enum
{
  RCC_CLKSTATE_UNDEF, // Undefined state
  RCC_CLKSTATE_OFF,
  RCC_CLKSTATE_ON
};

/* Standard clocks config structure (neither osc, nor PLL) */
typedef struct
{
  uint16_t id;        // Clock ID
  uint16_t source;    // Source clock ID
  uint16_t state;     // Clock state (RCC_CLKSTATE_xxx)
  uint32_t divvalue;  // Real divider value (0=undef)
} RCC_ClkCfgTypeDef;

typedef struct
{
  uint16_t id;        // Mux ID
  uint16_t source;    // Mux input selection
} RCC_MuxCfgTypeDef;

HAL_StatusTypeDef       HAL_RCC_GetOscCfg(RCC_OscCfgTypeDef *osc);
HAL_StatusTypeDef       HAL_RCC_SetOscCfg(RCC_OscCfgTypeDef *osc);

HAL_StatusTypeDef       HAL_RCC_GetPllCfg(RCC_PLLCfgTypeDef *pll);
HAL_StatusTypeDef       HAL_RCC_SetPllCfg(RCC_PLLCfgTypeDef *pll);

HAL_StatusTypeDef       HAL_RCC_GetClockCfg(RCC_ClkCfgTypeDef *clk);
HAL_StatusTypeDef       HAL_RCC_SetClockCfg(RCC_ClkCfgTypeDef *clk);

HAL_StatusTypeDef       HAL_RCC_SetCA35SSCfg(RCC_MuxCfgTypeDef *mux);
HAL_StatusTypeDef       HAL_RCC_GetCA35SSCfg(RCC_MuxCfgTypeDef *mux);

HAL_StatusTypeDef       HAL_RCC_SetBusClockCfg(RCC_ClkCfgTypeDef *clk);
HAL_StatusTypeDef       HAL_RCC_GetBusClockCfg(RCC_ClkCfgTypeDef *clk);

HAL_StatusTypeDef       HAL_RCC_SetPeriphClockCfg(RCC_ClkCfgTypeDef *clk);
HAL_StatusTypeDef       HAL_RCC_GetPeriphClockCfg(RCC_ClkCfgTypeDef *clk);

void                    HAL_RCC_EnableHSECSS(void);
void                    HAL_RCC_EnableLSECSS(void);

uint32_t                HAL_RCC_GetFreq(uint32_t clk_id); // Get clock freq
uint32_t                HAL_RCC_GetFreqM(uint32_t clk_id); // Get clock measured freq
uint16_t                HAL_RCC_GetSource(uint32_t clk_id); // Get clock source ID
int                     HAL_RCC_IsEnabled(uint32_t clk_id); // Returns 1 if enabled, 0 else
int                     HAL_RCC_IsRunning(uint32_t clk_id); // Returns 1 if running, 0 else
int                     HAL_RCC_IsReady(uint32_t clk_id); // Returns 1 if ready (OSC or PLL cases), 0 else
HAL_StatusTypeDef       HAL_RCC_Xable(uint32_t clk_id, int enable); // Enable or disable clock

