STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Inc/stm32mp2xx_hal_rcc_valid.h
/* Clock sleep enable macros */
#define __HAL_RCC_VDERAM_CLK_SLEEP_ENABLE() SET_BIT(RCC->VDERAMCFGR, RCC_VDERAMCFGR_VDERAMLPEN)
#define __HAL_RCC_SERC_CLK_SLEEP_ENABLE() SET_BIT(RCC->SERCCFGR, RCC_SERCCFGR_SERCLPEN)
#define __HAL_RCC_OSPIIOM_CLK_SLEEP_ENABLE() SET_BIT(RCC->OSPIIOMCFGR, RCC_OSPIIOMCFGR_OSPIIOMLPEN)
#define __HAL_RCC_ETHSW_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETHSWCFGR, RCC_ETHSWCFGR_ETHSWMACLPEN|\
                                                   RCC_ETHSWCFGR_ETHSWLPEN|RCC_ETHSWCFGR_ETHSWREFLPEN)
#define __HAL_RCC_VDEC_CLK_SLEEP_ENABLE() SET_BIT(RCC->VDECCFGR, RCC_VDECCFGR_VDECLPEN)
#define __HAL_RCC_VENC_CLK_SLEEP_ENABLE() SET_BIT(RCC->VENCCFGR, RCC_VENCCFGR_VENCLPEN)
#define __HAL_RCC_C3_CLK_SLEEP_ENABLE() SET_BIT(RCC->C3CFGR, RCC_C3CFGR_C3LPEN)
#define __HAL_RCC_SYSRAM_CLK_SLEEP_ENABLE() SET_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMCFGR_SYSRAMLPEN)
#define __HAL_RCC_SRAM1_CLK_SLEEP_ENABLE() SET_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1LPEN)
#define __HAL_RCC_SRAM2_CLK_SLEEP_ENABLE() SET_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2LPEN)
#define __HAL_RCC_RETRAM_CLK_SLEEP_ENABLE() SET_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMLPEN)
#define __HAL_RCC_BKPSRAM_CLK_SLEEP_ENABLE() SET_BIT(RCC->BKPSRAMCFGR, RCC_BKPSRAMCFGR_BKPSRAMLPEN)
#define __HAL_RCC_LPSRAM1_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1LPEN)
#define __HAL_RCC_LPSRAM2_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2LPEN)
#define __HAL_RCC_LPSRAM3_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3LPEN)
#define __HAL_RCC_OSPI1_CLK_SLEEP_ENABLE() SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1LPEN)
#define __HAL_RCC_OSPI2_CLK_SLEEP_ENABLE() SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2LPEN)
#define __HAL_RCC_STM500_CLK_SLEEP_ENABLE() SET_BIT(RCC->STM500CFGR, RCC_STM500CFGR_STM500LPEN)
#define __HAL_RCC_ETR_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETRLPEN)
#define __HAL_RCC_GPIOA_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOB_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOC_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOD_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOE_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOF_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOG_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOH_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOI_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOJ_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOK_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOZ_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZLPEN)
#define __HAL_RCC_HPDMA1_CLK_SLEEP_ENABLE() SET_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1LPEN)
#define __HAL_RCC_HPDMA2_CLK_SLEEP_ENABLE() SET_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2LPEN)
#define __HAL_RCC_HPDMA3_CLK_SLEEP_ENABLE() SET_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3LPEN)
#define __HAL_RCC_LPDMA_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMALPEN)
#define __HAL_RCC_HSEM_CLK_SLEEP_ENABLE() SET_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMLPEN)
#define __HAL_RCC_IPCC1_CLK_SLEEP_ENABLE() SET_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1LPEN)
#define __HAL_RCC_IPCC2_CLK_SLEEP_ENABLE() SET_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2LPEN)
#define __HAL_RCC_RTC_CLK_SLEEP_ENABLE() SET_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCLPEN)
#define __HAL_RCC_SYSCPU1_CLK_SLEEP_ENABLE() SET_BIT(RCC->SYSCPU1CFGR, RCC_SYSCPU1CFGR_SYSCPU1LPEN)
#define __HAL_RCC_IS2M_CLK_SLEEP_ENABLE() SET_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MLPEN)
#define __HAL_RCC_TIM1_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1LPEN)
#define __HAL_RCC_TIM2_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2LPEN)
#define __HAL_RCC_TIM3_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3LPEN)
#define __HAL_RCC_TIM4_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4LPEN)
#define __HAL_RCC_TIM5_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5LPEN)
#define __HAL_RCC_TIM6_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6LPEN)
#define __HAL_RCC_TIM7_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7LPEN)
#define __HAL_RCC_TIM8_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8LPEN)
#define __HAL_RCC_TIM10_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10LPEN)
#define __HAL_RCC_TIM11_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11LPEN)
#define __HAL_RCC_TIM12_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12LPEN)
#define __HAL_RCC_TIM13_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13LPEN)
#define __HAL_RCC_TIM14_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14LPEN)
#define __HAL_RCC_TIM15_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15LPEN)
#define __HAL_RCC_TIM16_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16LPEN)
#define __HAL_RCC_TIM17_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17LPEN)
#define __HAL_RCC_TIM20_CLK_SLEEP_ENABLE() SET_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20LPEN)
#define __HAL_RCC_LPTIM1_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1LPEN)
#define __HAL_RCC_LPTIM2_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2LPEN)
#define __HAL_RCC_LPTIM3_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3LPEN)
#define __HAL_RCC_LPTIM4_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4LPEN)
#define __HAL_RCC_LPTIM5_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5LPEN)
#define __HAL_RCC_SPI1_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1LPEN)
#define __HAL_RCC_SPI2_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2LPEN)
#define __HAL_RCC_SPI3_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3LPEN)
#define __HAL_RCC_SPI4_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4LPEN)
#define __HAL_RCC_SPI5_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5LPEN)
#define __HAL_RCC_SPI6_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6LPEN)
#define __HAL_RCC_SPI7_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7LPEN)
#define __HAL_RCC_SPI8_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8LPEN)
#define __HAL_RCC_SPDIFRX_CLK_SLEEP_ENABLE() SET_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXLPEN)
#define __HAL_RCC_USART1_CLK_SLEEP_ENABLE() SET_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1LPEN)
#define __HAL_RCC_USART2_CLK_SLEEP_ENABLE() SET_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2LPEN)
#define __HAL_RCC_USART3_CLK_SLEEP_ENABLE() SET_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3LPEN)
#define __HAL_RCC_UART4_CLK_SLEEP_ENABLE() SET_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4LPEN)
#define __HAL_RCC_UART5_CLK_SLEEP_ENABLE() SET_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5LPEN)
#define __HAL_RCC_USART6_CLK_SLEEP_ENABLE() SET_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6LPEN)
#define __HAL_RCC_UART7_CLK_SLEEP_ENABLE() SET_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7LPEN)
#define __HAL_RCC_UART8_CLK_SLEEP_ENABLE() SET_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8LPEN)
#define __HAL_RCC_UART9_CLK_SLEEP_ENABLE() SET_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9LPEN)
#define __HAL_RCC_LPUART1_CLK_SLEEP_ENABLE() SET_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1LPEN)
#define __HAL_RCC_I2C1_CLK_SLEEP_ENABLE() SET_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1LPEN)
#define __HAL_RCC_I2C2_CLK_SLEEP_ENABLE() SET_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2LPEN)
#define __HAL_RCC_I2C3_CLK_SLEEP_ENABLE() SET_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3LPEN)
#define __HAL_RCC_I2C4_CLK_SLEEP_ENABLE() SET_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4LPEN)
#define __HAL_RCC_I2C5_CLK_SLEEP_ENABLE() SET_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5LPEN)
#define __HAL_RCC_I2C6_CLK_SLEEP_ENABLE() SET_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6LPEN)
#define __HAL_RCC_I2C7_CLK_SLEEP_ENABLE() SET_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7LPEN)
#define __HAL_RCC_I2C8_CLK_SLEEP_ENABLE() SET_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8LPEN)
#define __HAL_RCC_SAI1_CLK_SLEEP_ENABLE() SET_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1LPEN)
#define __HAL_RCC_SAI2_CLK_SLEEP_ENABLE() SET_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2LPEN)
#define __HAL_RCC_SAI3_CLK_SLEEP_ENABLE() SET_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3LPEN)
#define __HAL_RCC_SAI4_CLK_SLEEP_ENABLE() SET_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4LPEN)
#define __HAL_RCC_MDF1_CLK_SLEEP_ENABLE() SET_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1LPEN)
#if ! defined(STM32MP2XX_ASSY3_1_0)
#define __HAL_RCC_ADF1_CLK_SLEEP_ENABLE() SET_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1LPEN)
#else /* ! defined(STM32MP2XX_ASSY3_1_0) */
#define __HAL_RCC_MDF2_CLK_SLEEP_ENABLE() SET_BIT(RCC->MDF2CFGR, RCC_MDF2CFGR_MDF2LPEN)
#endif /* ! defined(STM32MP2XX_ASSY3_1_0) */
#define __HAL_RCC_FDCAN_CLK_SLEEP_ENABLE() SET_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANLPEN)
#define __HAL_RCC_ADC12_CLK_SLEEP_ENABLE() SET_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12LPEN)
#define __HAL_RCC_ADC3_CLK_SLEEP_ENABLE() SET_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3LPEN)
#define __HAL_RCC_ETH1_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1LPEN)
#define __HAL_RCC_ETH1MAC_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1MACLPEN)
#define __HAL_RCC_ETH1TX_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1TXLPEN)
#define __HAL_RCC_ETH1RX_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RXLPEN)
#define __HAL_RCC_ETH2_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2LPEN)
#define __HAL_RCC_ETH2MAC_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2MACLPEN)
#define __HAL_RCC_ETH2TX_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2TXLPEN)
#define __HAL_RCC_ETH2RX_CLK_SLEEP_ENABLE() SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RXLPEN)
#define __HAL_RCC_USB2_CLK_SLEEP_ENABLE() SET_BIT(RCC->USB2CFGR, RCC_USB2CFGR_USB2LPEN)
#define __HAL_RCC_USB2PHY1_CLK_SLEEP_ENABLE() SET_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1LPEN)
#define __HAL_RCC_USB2PHY2_CLK_SLEEP_ENABLE() SET_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2LPEN)
#define __HAL_RCC_USB3DRD_CLK_SLEEP_ENABLE() SET_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDLPEN)
#define __HAL_RCC_USB3PCIEPHY_CLK_SLEEP_ENABLE() SET_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN)
#define __HAL_RCC_PCIE_CLK_SLEEP_ENABLE() SET_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIELPEN)
#define __HAL_RCC_UCPD1_CLK_SLEEP_ENABLE() SET_BIT(RCC->UCPD1CFGR, RCC_UCPD1CFGR_UCPD1LPEN)
#define __HAL_RCC_FMC_CLK_SLEEP_ENABLE() SET_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCLPEN)
#define __HAL_RCC_SDMMC1_CLK_SLEEP_ENABLE() SET_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1LPEN)
#define __HAL_RCC_SDMMC2_CLK_SLEEP_ENABLE() SET_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2LPEN)
#define __HAL_RCC_SDMMC3_CLK_SLEEP_ENABLE() SET_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3LPEN)
#define __HAL_RCC_GPU_CLK_SLEEP_ENABLE() SET_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPULPEN)
#define __HAL_RCC_LTDC_CLK_SLEEP_ENABLE() SET_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCLPEN)
#define __HAL_RCC_DSI_CLK_SLEEP_ENABLE() SET_BIT(RCC->DSICFGR, RCC_DSICFGR_DSILPEN)
#define __HAL_RCC_LVDS_CLK_SLEEP_ENABLE() SET_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSLPEN)
#define __HAL_RCC_CSI2_CLK_SLEEP_ENABLE() SET_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2LPEN)
#define __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE() SET_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPLPEN)
#define __HAL_RCC_CCI_CLK_SLEEP_ENABLE() SET_BIT(RCC->CCICFGR, RCC_CCICFGR_CCILPEN)
#define __HAL_RCC_RNG_CLK_SLEEP_ENABLE() SET_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGLPEN)
#define __HAL_RCC_PKA_CLK_SLEEP_ENABLE() SET_BIT(RCC->PKACFGR, RCC_PKACFGR_PKALPEN)
#define __HAL_RCC_SAES_CLK_SLEEP_ENABLE() SET_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESLPEN)
#define __HAL_RCC_HASH_CLK_SLEEP_ENABLE() SET_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHLPEN)
#define __HAL_RCC_CRYP1_CLK_SLEEP_ENABLE() SET_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1LPEN)
#define __HAL_RCC_CRYP2_CLK_SLEEP_ENABLE() SET_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2LPEN)
#define __HAL_RCC_IWDG1_CLK_SLEEP_ENABLE() SET_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1LPEN)
#define __HAL_RCC_IWDG2_CLK_SLEEP_ENABLE() SET_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2LPEN)
#define __HAL_RCC_IWDG3_CLK_SLEEP_ENABLE() SET_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3LPEN)
#define __HAL_RCC_IWDG4_CLK_SLEEP_ENABLE() SET_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4LPEN)
#define __HAL_RCC_IWDG5_CLK_SLEEP_ENABLE() SET_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5LPEN)
#define __HAL_RCC_WWDG1_CLK_SLEEP_ENABLE() SET_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1LPEN)
#define __HAL_RCC_WWDG2_CLK_SLEEP_ENABLE() SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2LPEN)
#define __HAL_RCC_BUSPERFM_CLK_SLEEP_ENABLE() SET_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMLPEN)
#define __HAL_RCC_VREF_CLK_SLEEP_ENABLE() SET_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFLPEN)
#define __HAL_RCC_TMPSENS_CLK_SLEEP_ENABLE() SET_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSLPEN)
#define __HAL_RCC_CRC_CLK_SLEEP_ENABLE() SET_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCLPEN)
#define __HAL_RCC_BSEC_CLK_SLEEP_ENABLE() SET_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECLPEN)
#define __HAL_RCC_GICV2M_CLK_SLEEP_ENABLE() SET_BIT(RCC->GICV2MCFGR, RCC_GICV2MCFGR_GICV2MLPEN)
#define __HAL_RCC_I3C1_CLK_SLEEP_ENABLE() SET_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1LPEN)
#define __HAL_RCC_I3C2_CLK_SLEEP_ENABLE() SET_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2LPEN)
#define __HAL_RCC_I3C3_CLK_SLEEP_ENABLE() SET_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3LPEN)
#define __HAL_RCC_I3C4_CLK_SLEEP_ENABLE() SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4LPEN)

