STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Inc/stm32mp2xx_hal_rcc_valid.h
/* Allows/Prevents CStop & Enhanced CSleep modes for all A35_* cores */
#ifdef CORE_CA35
#define __HAL_RCC_ALLOW_CSTOP() SET_BIT(RCC->C1SREQSETR, RCC_C1SREQSETR_STPREQ_P1 | RCC_C1SREQSETR_STPREQ_P0)
#define __HAL_RCC_PREVENT_CSTOP() SET_BIT(RCC->C1SREQCLRR, RCC_C1SREQCLRR_STPREQ_P1 | RCC_C1SREQCLRR_STPREQ_P0)
#define __HAL_RCC_ALLOW_ENHANCED_CSLEEP() SET_BIT(RCC->C1SREQSETR, RCC_C1SREQSETR_ESLPREQ)
#define __HAL_RCC_PREVENT_ENHANCED_CSLEEP() SET_BIT(RCC->C1SREQCLRR, RCC_C1SREQCLRR_ESLPREQ)
#endif

/* RCC_Calibration limits */
#define IS_RCC_HSICALIBRATION_VALUE(VALUE) ((VALUE) <= 0x3F) /* @TODO:Be sure value is right */
#define IS_RCC_CSICALIBRATION_VALUE(VALUE) ((VALUE) <= 0x1F) /* @TODO:Be sure value is right */

/* MCO1 clock output control */
#define __HAL_RCC_MCO1_ENABLE()   SET_BIT(RCC->MCO1CFGR, RCC_MCO1CFGR_MCO1ON)
#define __HAL_RCC_MCO1_DISABLE()  CLEAR_BIT(RCC->MCO1CFGR, RCC_MCO1CFGR_MCO1ON)

/**
  * @brief  Macro to select source clock for MCO1 output
  *
  * @param  __RCC_MCO1SOURCE__: specifies the MCO1 entry clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_CK_MCO1: Flexiclockgen output 61
  *            @arg RCC_CK_OBS0: Flexiclockgen observation clock 0
  *
  * @retval None
  */
#define __HAL_RCC_MCO1_SETSOURCE(__RCC_MCO1SOURCE__) \
  MODIFY_REG( RCC->MCO1CFGR, RCC_MCO1CFGR_MCO1SEL, (__RCC_MCO1SOURCE__ == RCC_CK_MCO1) ?  0 : RCC_MCO1CFGR_MCO1SEL )

/** @brief  Macro to get the clock source used as MCO1 clock.
  * @retval The clock source used as MCO1 clock. The returned value can be one
  *         of the following:
  *            @arg RCC_CK_MCO1: Flexiclockgen output 61
  *            @arg RCC_CK_OBS0: Flexiclockgen observation clock 0
  */
#define __HAL_RCC_MCO1_GETSOURCE() ((RCC->MCO1CFGR & RCC_MCO1CFGR_MCO1SEL) ? RCC_CK_OBS0 : RCC_CK_MCO1)

/* MCO2 clock output control */
#define __HAL_RCC_MCO2_ENABLE()   SET_BIT(RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2ON)
#define __HAL_RCC_MCO2_DISABLE()  CLEAR_BIT(RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2ON)

/**
  * @brief  Macro to select source clock for MCO2 output
  *
  * @param  __RCC_MCO2SOURCE__: specifies the MCO2 entry clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_CK_MCO2: Flexiclockgen output 62
  *            @arg RCC_CK_OBS1: Flexiclockgen observation clock 1
  *
  * @retval None
  */
#define __HAL_RCC_MCO2_SETSOURCE(__RCC_MCO2SOURCE__) \
  MODIFY_REG( RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2SEL, (__RCC_MCO2SOURCE__ == RCC_CK_MCO2) ?  0 : RCC_MCO2CFGR_MCO2SEL );

/** @brief  Macro to get the clock source used as MCO2 clock.
  * @retval The clock source used as MCO2 clock. The returned value can be one
  *         of the following:
  *            @arg RCC_CK_MCO2: Flexiclockgen output 62
  *            @arg RCC_CK_OBS1: Flexiclockgen observation clock 1
  */
#define __HAL_RCC_MCO2_GETSOURCE() ((RCC->MCO2CFGR & RCC_MCO2CFGR_MCO2SEL) ? RCC_CK_OBS1 : RCC_CK_MCO2)

/** @brief  Check RCC flag is set or not.
  * @param  __FLAG__: specifies the flag to check.
  *         This parameter can be one of the following values:
  *         @TODO: To compleate this description
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */

/** @defgroup RCC_ADC12_Kernel_Clock_Source RCC_ADC12_Kernel_Clock_Source
  * @{
  */
#define RCC_ADC12KERCLKSOURCE_CK_KER_ADC12     (0x0 << RCC_ADC12CFGR_ADC12KERSEL_Pos)
#define RCC_ADC12KERCLKSOURCE_CK_ICN_LS_MCU    (0x1 << RCC_ADC12CFGR_ADC12KERSEL_Pos)

#define IS_RCC_ADC12KERCLKSOURCE(SOURCE) (((SOURCE) == RCC_ADC12KERCLKSOURCE_CK_KER_ADC12) || \
                                          ((SOURCE) == RCC_ADC12KERCLKSOURCE_CK_ICN_LS_MCU))

/**
  * @brief  Macro to select ADC12 kernel source clock
  *
  * @param  __RCC_ADC12KERSOURCE__: specifies the ADC12 entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ADC12KERCLKSOURCE_CK_KER_ADC12:  "ck_ker_adc12"  Flexiclockgen output 46
  *            @arg RCC_ADC12KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  *
  * @retval None
  */
#define __HAL_RCC_ADC12KERCLK_SETSOURCE(__RCC_ADC12KERSOURCE__) \
  MODIFY_REG( RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12KERSEL,(__RCC_ADC12KERSOURCE__)  )

/** @brief  Macro to get the clock source used as ADC12 kernel source clock.
  * @retval The clock source used as ADC12 kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_ADC12KERCLKSOURCE_CK_KER_ADC12:  "ck_ker_adc12"  Flexiclockgen output 46
  *            @arg RCC_ADC12KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  */
#define __HAL_RCC_ADC12KERCLK_GETSOURCE() ( (RCC->ADC12CFGR & RCC_ADC12CFGR_ADC12KERSEL_Msk) )

/** @defgroup RCC_ADC3_Kernel_Clock_Source RCC_ADC3_Kernel_Clock_Source
  * @{
  */
#define RCC_ADC3KERCLKSOURCE_CK_KER_ADC3      (0x0 << RCC_ADC3CFGR_ADC3KERSEL_Pos)
#define RCC_ADC3KERCLKSOURCE_CK_ICN_LS_MCU    (0x1 << RCC_ADC3CFGR_ADC3KERSEL_Pos)
#define RCC_ADC3KERCLKSOURCE_CK_KER_ADC12     (0x2 << RCC_ADC3CFGR_ADC3KERSEL_Pos)

#define IS_RCC_ADC3KERCLKSOURCE(SOURCE) (((SOURCE) == RCC_ADC3KERCLKSOURCE_CK_KER_ADC3) || \
                                         ((SOURCE) == RCC_ADC3KERCLKSOURCE_CK_ICN_LS_MCU) || \
                                         ((SOURCE) == RCC_ADC3KERCLKSOURCE_CK_KER_ADC12))

/**
  * @brief  Macro to select ADC3 kernel source clock
  *
  * @param  __RCC_ADC3KERSOURCE__: specifies the ADC3 entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ADC3KERCLKSOURCE_CK_KER_ADC3:   "ck_ker_adc3"   Flexiclockgen output 47
  *            @arg RCC_ADC3KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  *            @arg RCC_ADC3KERCLKSOURCE_CK_KER_ADC12:  "ck_ker_adc12"  Flexiclockgen output 46
  *
  * @retval None
  */
#define __HAL_RCC_ADC3KERCLK_SETSOURCE(__RCC_ADC3KERSOURCE__) \
  MODIFY_REG( RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3KERSEL, (__RCC_ADC3KERSOURCE__)  )

/** @brief  Macro to get the clock source used as ADC3 kernel source clock.
  * @retval The clock source used as ADC3 kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_ADC3KERCLKSOURCE_CK_KER_ADC3:   "ck_ker_adc3"   Flexiclockgen output 47
  *            @arg RCC_ADC3KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  *            @arg RCC_ADC3KERCLKSOURCE_CK_KER_ADC12:  "ck_ker_adc12"  Flexiclockgen output 46
  */
#define __HAL_RCC_ADC3KERCLK_GETSOURCE() ( (RCC->ADC3CFGR & RCC_ADC3CFGR_ADC3KERSEL_Msk) )

#define __HAL_RCC_GET_FLAG(__FLAG__) ( __FLAG__ ? 1:0 )

