STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Inc/stm32mp2xx_hal_rcc_valid.h
/******************************************************************************
  * RESETS management
  ******************************************************************************/

/* Reset force macros */
#define __HAL_RCC_SERC_FORCE_RESET() SET_BIT(RCC->SERCCFGR, RCC_SERCCFGR_SERCRST)
#define __HAL_RCC_OSPIIOM_FORCE_RESET() SET_BIT(RCC->OSPIIOMCFGR, RCC_OSPIIOMCFGR_OSPIIOMRST)
#define __HAL_RCC_ETHSW_FORCE_RESET() SET_BIT(RCC->ETHSWCFGR, RCC_ETHSWCFGR_ETHSWRST)
#define __HAL_RCC_VDEC_FORCE_RESET() SET_BIT(RCC->VDECCFGR, RCC_VDECCFGR_VDECRST)
#define __HAL_RCC_VENC_FORCE_RESET() SET_BIT(RCC->VENCCFGR, RCC_VENCCFGR_VENCRST)
#define __HAL_RCC_C3_FORCE_RESET() SET_BIT(RCC->C3CFGR, RCC_C3CFGR_C3RST)
#define __HAL_RCC_OSPI1_FORCE_RESET() SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1RST)
#define __HAL_RCC_OSPI2_FORCE_RESET() SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2RST)
#if ! defined(STM32MP2XX_ASSY3_1_0)
#define __HAL_RCC_OTFDEC1_FORCE_RESET() SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OTFDEC1RST)
#define __HAL_RCC_OTFDEC2_FORCE_RESET() SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OTFDEC2RST)
#endif /* ! defined(STM32MP2XX_ASSY3_1_0) */
#define __HAL_RCC_GPIOA_FORCE_RESET() SET_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxRST)
#define __HAL_RCC_GPIOB_FORCE_RESET() SET_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxRST)
#define __HAL_RCC_GPIOC_FORCE_RESET() SET_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxRST)
#define __HAL_RCC_GPIOD_FORCE_RESET() SET_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxRST)
#define __HAL_RCC_GPIOE_FORCE_RESET() SET_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxRST)
#define __HAL_RCC_GPIOF_FORCE_RESET() SET_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxRST)
#define __HAL_RCC_GPIOG_FORCE_RESET() SET_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxRST)
#define __HAL_RCC_GPIOH_FORCE_RESET() SET_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxRST)
#define __HAL_RCC_GPIOI_FORCE_RESET() SET_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxRST)
#define __HAL_RCC_GPIOJ_FORCE_RESET() SET_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxRST)
#define __HAL_RCC_GPIOK_FORCE_RESET() SET_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxRST)
#define __HAL_RCC_GPIOZ_FORCE_RESET() SET_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZRST)
#define __HAL_RCC_HPDMA1_FORCE_RESET() SET_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1RST)
#define __HAL_RCC_HPDMA2_FORCE_RESET() SET_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2RST)
#define __HAL_RCC_HPDMA3_FORCE_RESET() SET_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3RST)
#define __HAL_RCC_LPDMA_FORCE_RESET() SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMARST)
#define __HAL_RCC_HSEM_FORCE_RESET() SET_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMRST)
#define __HAL_RCC_IPCC1_FORCE_RESET() SET_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1RST)
#define __HAL_RCC_IPCC2_FORCE_RESET() SET_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2RST)
#define __HAL_RCC_IS2M_FORCE_RESET() SET_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MRST)
#define __HAL_RCC_TIM1_FORCE_RESET() SET_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1RST)
#define __HAL_RCC_TIM2_FORCE_RESET() SET_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2RST)
#define __HAL_RCC_TIM3_FORCE_RESET() SET_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3RST)
#define __HAL_RCC_TIM4_FORCE_RESET() SET_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4RST)
#define __HAL_RCC_TIM5_FORCE_RESET() SET_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5RST)
#define __HAL_RCC_TIM6_FORCE_RESET() SET_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6RST)
#define __HAL_RCC_TIM7_FORCE_RESET() SET_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7RST)
#define __HAL_RCC_TIM8_FORCE_RESET() SET_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8RST)
#define __HAL_RCC_TIM10_FORCE_RESET() SET_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10RST)
#define __HAL_RCC_TIM11_FORCE_RESET() SET_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11RST)
#define __HAL_RCC_TIM12_FORCE_RESET() SET_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12RST)
#define __HAL_RCC_TIM13_FORCE_RESET() SET_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13RST)
#define __HAL_RCC_TIM14_FORCE_RESET() SET_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14RST)
#define __HAL_RCC_TIM15_FORCE_RESET() SET_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15RST)
#define __HAL_RCC_TIM16_FORCE_RESET() SET_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16RST)
#define __HAL_RCC_TIM17_FORCE_RESET() SET_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17RST)
#define __HAL_RCC_TIM20_FORCE_RESET() SET_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20RST)
#define __HAL_RCC_LPTIM1_FORCE_RESET() SET_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1RST)
#define __HAL_RCC_LPTIM2_FORCE_RESET() SET_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2RST)
#define __HAL_RCC_LPTIM3_FORCE_RESET() SET_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3RST)
#define __HAL_RCC_LPTIM4_FORCE_RESET() SET_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4RST)
#define __HAL_RCC_LPTIM5_FORCE_RESET() SET_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5RST)
#define __HAL_RCC_SPI1_FORCE_RESET() SET_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1RST)
#define __HAL_RCC_SPI2_FORCE_RESET() SET_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2RST)
#define __HAL_RCC_SPI3_FORCE_RESET() SET_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3RST)
#define __HAL_RCC_SPI4_FORCE_RESET() SET_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4RST)
#define __HAL_RCC_SPI5_FORCE_RESET() SET_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5RST)
#define __HAL_RCC_SPI6_FORCE_RESET() SET_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6RST)
#define __HAL_RCC_SPI7_FORCE_RESET() SET_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7RST)
#define __HAL_RCC_SPI8_FORCE_RESET() SET_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8RST)
#define __HAL_RCC_SPDIFRX_FORCE_RESET() SET_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXRST)
#define __HAL_RCC_USART1_FORCE_RESET() SET_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1RST)
#define __HAL_RCC_USART2_FORCE_RESET() SET_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2RST)
#define __HAL_RCC_USART3_FORCE_RESET() SET_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3RST)
#define __HAL_RCC_UART4_FORCE_RESET() SET_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4RST)
#define __HAL_RCC_UART5_FORCE_RESET() SET_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5RST)
#define __HAL_RCC_USART6_FORCE_RESET() SET_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6RST)
#define __HAL_RCC_UART7_FORCE_RESET() SET_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7RST)
#define __HAL_RCC_UART8_FORCE_RESET() SET_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8RST)
#define __HAL_RCC_UART9_FORCE_RESET() SET_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9RST)
#define __HAL_RCC_LPUART1_FORCE_RESET() SET_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1RST)
#define __HAL_RCC_I2C1_FORCE_RESET() SET_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1RST)
#define __HAL_RCC_I2C2_FORCE_RESET() SET_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2RST)
#define __HAL_RCC_I2C3_FORCE_RESET() SET_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3RST)
#define __HAL_RCC_I2C4_FORCE_RESET() SET_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4RST)
#define __HAL_RCC_I2C5_FORCE_RESET() SET_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5RST)
#define __HAL_RCC_I2C6_FORCE_RESET() SET_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6RST)
#define __HAL_RCC_I2C7_FORCE_RESET() SET_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7RST)
#define __HAL_RCC_I2C8_FORCE_RESET() SET_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8RST)
#define __HAL_RCC_SAI1_FORCE_RESET() SET_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1RST)
#define __HAL_RCC_SAI2_FORCE_RESET() SET_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2RST)
#define __HAL_RCC_SAI3_FORCE_RESET() SET_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3RST)
#define __HAL_RCC_SAI4_FORCE_RESET() SET_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4RST)
#define __HAL_RCC_MDF1_FORCE_RESET() SET_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1RST)
#if ! defined(STM32MP2XX_ASSY3_1_0)
#define __HAL_RCC_ADF1_FORCE_RESET() SET_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1RST)
#else /* ! defined(STM32MP2XX_ASSY3_1_0) */
#define __HAL_RCC_MDF2_FORCE_RESET() SET_BIT(RCC->MDF2CFGR, RCC_MDF2CFGR_MDF2RST)
#endif /* ! defined(STM32MP2XX_ASSY3_1_0) */
#define __HAL_RCC_FDCAN_FORCE_RESET() SET_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANRST)
#define __HAL_RCC_HDP_FORCE_RESET() SET_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPRST)
#define __HAL_RCC_ADC12_FORCE_RESET() SET_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12RST)
#define __HAL_RCC_ADC3_FORCE_RESET() SET_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3RST)
#define __HAL_RCC_ETH1_FORCE_RESET() SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RST)
#define __HAL_RCC_ETH2_FORCE_RESET() SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RST)
#define __HAL_RCC_USB2_FORCE_RESET() SET_BIT(RCC->USB2CFGR, RCC_USB2CFGR_USB2RST)
#define __HAL_RCC_USB2PHY1_FORCE_RESET() SET_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1RST)
#define __HAL_RCC_USB2PHY2_FORCE_RESET() SET_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2RST)
#define __HAL_RCC_USB3DRD_FORCE_RESET() SET_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDRST)
#define __HAL_RCC_USB3PCIEPHY_FORCE_RESET() SET_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST)
#define __HAL_RCC_PCIE_FORCE_RESET() SET_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIERST)
#define __HAL_RCC_UCPD1_FORCE_RESET() SET_BIT(RCC->UCPD1CFGR, RCC_UCPD1CFGR_UCPD1RST)
#define __HAL_RCC_FMC_FORCE_RESET() SET_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCRST)
#define __HAL_RCC_SDMMC1_FORCE_RESET() SET_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1RST)
#define __HAL_RCC_SDMMC2_FORCE_RESET() SET_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2RST)
#define __HAL_RCC_SDMMC3_FORCE_RESET() SET_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3RST)
#define __HAL_RCC_GPU_FORCE_RESET() SET_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPURST)
#define __HAL_RCC_LTDC_FORCE_RESET() SET_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCRST)
#define __HAL_RCC_DSI_FORCE_RESET() SET_BIT(RCC->DSICFGR, RCC_DSICFGR_DSIRST)
#define __HAL_RCC_LVDS_FORCE_RESET() SET_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSRST)
#define __HAL_RCC_CSI2_FORCE_RESET() SET_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2RST)
#define __HAL_RCC_DCMIPP_FORCE_RESET() SET_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPRST)
#define __HAL_RCC_CCI_FORCE_RESET() SET_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIRST)
#define __HAL_RCC_RNG_FORCE_RESET() SET_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGRST)
#define __HAL_RCC_PKA_FORCE_RESET() SET_BIT(RCC->PKACFGR, RCC_PKACFGR_PKARST)
#define __HAL_RCC_SAES_FORCE_RESET() SET_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESRST)
#define __HAL_RCC_HASH_FORCE_RESET() SET_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHRST)
#define __HAL_RCC_CRYP1_FORCE_RESET() SET_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1RST)
#define __HAL_RCC_CRYP2_FORCE_RESET() SET_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2RST)
#define __HAL_RCC_WWDG1_FORCE_RESET() SET_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1RST)
#define __HAL_RCC_WWDG2_FORCE_RESET() SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2RST)
#define __HAL_RCC_BUSPERFM_FORCE_RESET() SET_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMRST)
#define __HAL_RCC_VREF_FORCE_RESET() SET_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFRST)
#define __HAL_RCC_TMPSENS_FORCE_RESET() SET_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSRST)
#define __HAL_RCC_CRC_FORCE_RESET() SET_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCRST)
#define __HAL_RCC_I3C1_FORCE_RESET() SET_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1RST)
#define __HAL_RCC_I3C2_FORCE_RESET() SET_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2RST)
#define __HAL_RCC_I3C3_FORCE_RESET() SET_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3RST)
#define __HAL_RCC_I3C4_FORCE_RESET() SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4RST)

