STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Inc/stm32mp2xx_hal_rcc_valid.h
/** @brief  Macros to manage IWDG3 (through registers RCC_IWDGC2CFGSETR/RCC_IWDGC2CFGCLRR/RCC_IWDGC2FZSETR/RCC_IWDGC2FZCLRR)
  */
#define __HAL_RCC_IWDG3_SYSRST_ENABLE()   SET_BIT(RCC->IWDGC2CFGSETR, RCC_IWDGC2CFGSETR_IWDG3_SYSRSTEN)
#define __HAL_RCC_IWDG3_SYSRST_DISABLE()  SET_BIT(RCC->IWDGC2CFGCLRR, RCC_IWDGC2CFGCLRR_IWDG3_SYSRSTEN)
#define __HAL_RCC_IWDG3_CLK_FREEZE()      SET_BIT(RCC->IWDGC2FZSETR, RCC_IWDGC2FZSETR_FZ_IWDG3)
#define __HAL_RCC_IWDG3_CLK_UNFREEZE()    SET_BIT(RCC->IWDGC2FZCLRR, RCC_IWDGC2FZCLRR_FZ_IWDG3)

/** @brief  Macros to manage IWDG4 (through registers RCC_IWDGC2CFGSETR/RCC_IWDGC2CFGCLRR/RCC_IWDGC2FZSETR/RCC_IWDGC2FZCLRR)
  */
#define __HAL_RCC_IWDG4_SYSRST_ENABLE()   SET_BIT(RCC->IWDGC2CFGSETR, RCC_IWDGC2CFGSETR_IWDG4_SYSRSTEN)
#define __HAL_RCC_IWDG4_SYSRST_DISABLE()  SET_BIT(RCC->IWDGC2CFGCLRR, RCC_IWDGC2CFGCLRR_IWDG4_SYSRSTEN)
#define __HAL_RCC_IWDG4_KERRST_ENABLE()   SET_BIT(RCC->IWDGC2CFGSETR, RCC_IWDGC2CFGSETR_IWDG4_KERRST)
#define __HAL_RCC_IWDG4_KERRST_DISABLE()  SET_BIT(RCC->IWDGC2CFGCLRR, RCC_IWDGC2CFGCLRR_IWDG4_KERRST)
#define __HAL_RCC_IWDG4_CLK_FREEZE()      SET_BIT(RCC->IWDGC2FZSETR, RCC_IWDGC2FZSETR_FZ_IWDG4)
#define __HAL_RCC_IWDG4_CLK_UNFREEZE()    SET_BIT(RCC->IWDGC2FZCLRR, RCC_IWDGC2FZCLRR_FZ_IWDG4)

/** @brief  Macros to manage IWDG5 (through registers RCC_IWDGC3CFGSETR/RCC_IWDGC3CFGCLRR)
  */
#define __HAL_RCC_IWDG5_SYSRST_ENABLE()   SET_BIT(RCC->IWDGC3CFGSETR, RCC_IWDGC3CFGSETR_IWDG5_SYSRSTEN)
#define __HAL_RCC_IWDG5_SYSRST_DISABLE()  SET_BIT(RCC->IWDGC3CFGCLRR, RCC_IWDGC3CFGCLRR_IWDG5_SYSRSTEN)

/******************************************************************************
  * INTERRUPTS management
  ******************************************************************************/

/* Interrupts definition. Same for both CPU1/A35 & CPU2/M33 */
#define RCC_IT_LSIRDY       RCC_C1CIFCLRR_LSIRDYF
#define RCC_IT_LSERDY       RCC_C1CIFCLRR_LSERDYF
#define RCC_IT_HSIRDY       RCC_C1CIFCLRR_HSIRDYF
#define RCC_IT_HSERDY       RCC_C1CIFCLRR_HSERDYF
#define RCC_IT_CSIRDY       RCC_C1CIFCLRR_CSIRDYF
#define RCC_IT_PLL1RDY      RCC_C1CIFCLRR_PLL1RDYF
#define RCC_IT_PLL2RDY      RCC_C1CIFCLRR_PLL2RDYF
#define RCC_IT_PLL3RDY      RCC_C1CIFCLRR_PLL3RDYF
#define RCC_IT_PLL4RDY      RCC_C1CIFCLRR_PLL4RDYF
#define RCC_IT_PLL5RDY      RCC_C1CIFCLRR_PLL5RDYF
#define RCC_IT_PLL6RDY      RCC_C1CIFCLRR_PLL6RDYF
#define RCC_IT_PLL7RDY      RCC_C1CIFCLRR_PLL7RDYF
#define RCC_IT_PLL8RDY      RCC_C1CIFCLRR_PLL8RDYF
#define RCC_IT_LSECSS       RCC_C1CIFCLRR_LSECSSF
#define RCC_IT_WKUP         RCC_C1CIFCLRR_WKUPF

/** @brief  Enable RCC interrupt thru RCC_CxCIESETR register.
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_CSIRDY:  CSI ready interrupt
  *            @arg RCC_IT_PLL1RDY: PLL1RDY ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_PLL5RDY: PLL5RDY ready interrupt
  *            @arg RCC_IT_PLL6RDY: PLL6RDY ready interrupt
  *            @arg RCC_IT_PLL7RDY: PLL7RDY ready interrupt
  *            @arg RCC_IT_PLL8RDY: PLL8RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  */
#ifdef CORE_CA35
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) (RCC->C1CIESETR = (__INTERRUPT__))
#endif /* CORE_CA35 */
#ifdef CORE_CM33
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) (RCC->C2CIESETR = (__INTERRUPT__))
#endif /* CORE_CM33 */

/** @brief Disable RCC interrupt thru RCC_CxCIECLRR register.
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_CSIRDY:  CSI ready interrupt
  *            @arg RCC_IT_PLL1RDY: PLL1RDY ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_PLL5RDY: PLL5RDY ready interrupt
  *            @arg RCC_IT_PLL6RDY: PLL6RDY ready interrupt
  *            @arg RCC_IT_PLL7RDY: PLL7RDY ready interrupt
  *            @arg RCC_IT_PLL8RDY: PLL8RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  */

#ifdef CORE_CA35
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->C1CIESETR, (__INTERRUPT__))
#endif /* CORE_CA35 */
#ifdef CORE_CM33
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->C2CIESETR, (__INTERRUPT__))
#endif /* CORE_CM33 */

/** @brief  Clear some RCC's pending interrupts.
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_CSIRDY:  CSI ready interrupt
  *            @arg RCC_IT_PLL1RDY: PLL1RDY ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_PLL5RDY: PLL5RDY ready interrupt
  *            @arg RCC_IT_PLL6RDY: PLL6RDY ready interrupt
  *            @arg RCC_IT_PLL7RDY: PLL7RDY ready interrupt
  *            @arg RCC_IT_PLL8RDY: PLL8RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  */
#ifdef CORE_CA35
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) (RCC->C1CIFCLRR = (__INTERRUPT__))
#endif /* CORE_CA35 */
#ifdef CORE_CM33
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) (RCC->C2CIFCLRR = (__INTERRUPT__))
#endif /* CORE_CM33 */

/** @brief  Check the RCC's interrupt has occurred or not.
  * @param  __INTERRUPT__: specifies the RCC interrupt source to check.
  *         This parameter can be one of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_CSIRDY:  CSI ready interrupt
  *            @arg RCC_IT_PLL1RDY: CA35/PLL1 PLL ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_PLL5RDY: PLL5RDY ready interrupt
  *            @arg RCC_IT_PLL6RDY: PLL6RDY ready interrupt
  *            @arg RCC_IT_PLL7RDY: PLL7RDY ready interrupt
  *            @arg RCC_IT_PLL8RDY: PLL8RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#ifdef CORE_CA35
#define __HAL_RCC_GET_IT(__INTERRUPT__) (RCC->C1CIFCLRR & (__INTERRUPT__))
#endif /* CORE_CA35 */
#ifdef CORE_CM33
#define __HAL_RCC_GET_IT(__INTERRUPT__) (RCC->C2CIFCLRR & (__INTERRUPT__))
#endif /* CORE_CM33 */

