STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Inc/stm32mp2xx_hal_rcc_valid.h
/** @brief  Check the RCC's interrupt is enabled or not.
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#ifdef CORE_CA35
#define __HAL_RCC_IT_ENABLED(__INTERRUPT__) (RCC->C1CIESETR & (__INTERRUPT__))
#endif /* CORE_CA35 */
#ifdef CORE_CM33
#define __HAL_RCC_IT_ENABLED(__INTERRUPT__) (RCC->C2CIESETR & (__INTERRUPT__))
#endif /* CORE_CM33 */

void     HAL_RCC_WAKEUP_IRQHandler(void);
void     HAL_RCC_WAKEUP_Callback(void);
void     HAL_RCC_IRQHandler(void);
void     HAL_RCC_Callback(uint32_t Flags);

/******************************************************************************
  * MISC
  ******************************************************************************/

HAL_StatusTypeDef HAL_RCC_DeInit(void);

/* Include RCC HAL Extension module */
#include "stm32mp2xx_hal_rcc_ex_valid.h"

/***** MP2 RIF SPECIFIC : TO BE MERGED TO DIFFERENT "defgroup" HERE ABOVE *****/
/** @defgroup RCC_RIF_HAL RCC_RIF
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_HAL_RIF_Exported_Constants RCC HAL RIF Exported Constants
  * @{
  */

/** @defgroup RCC_HAL_EC_RIF_LOCALRES_ACCESS RCC HAL Filtering of Local Resource Access
  * @{
  */
/****************************************************************************/
/* WARNING about LEGACY constants !                                         */
/* FOR AVOIDING CONFUSION IN SECURITY & PRIVILEGE ACCESS FILTERING          */
/* - "NSEC" stands for "No Security Filtering for Local Resource Access",   */
/*   which means that not only "secure" but also "non-secure" accesses are  */
/*   allowed.                                                               */
/* - "NPRIV" stands for "No Privilege Filtering for Local Resource Access", */
/*   which means that not only "privileged" but also "not-privileged"       */
/*   accesses are allowed.                                                  */
/****************************************************************************/

#define RCC_LOCALRES_PRIV    0x00000E00   /*!< Privilege attribute for Local Resource Access Filtering */
#define RCC_LOCALRES_NPRIV   0x00000300   /*!< No Privilege attribute for Local Resource Access Filtering */
#define RCC_LOCALRES_NOPRIV  0x00000300   /*!< No Privilege attribute for Local Resource Access Filtering */

#define RCC_LOCALRES_SEC     0x00005000   /*!< Secure attribute for Local Resource Access Filtering */
#define RCC_LOCALRES_NSEC    0x00002000   /*!< Unsecure/No Security attribute for Local Resource Access Filtering */
#define RCC_LOCALRES_NOSEC   0x00002000   /*!< Unsecure/No Security attribute for Local Resource Access Filtering */

#define RCC_LOCALRES_LOCKED  0xDD000000   /*!< Lock attribute for configuration of Local Resource Access Filtering */
/**
  * @}
  */

/** @defgroup RCC_HAL_EC_RIF_LOCALRES_ATTRIBUTES RCC HAL Attributes for Local Resource Access Filtering
  * @{
  */
#define RCC_LOCALRES_ATTR_NONE     0x00000000   /*!< No Attribute value for Local Resource Access Filtering */
#define RCC_LOCALRES_ATTR_INVALID  0x2200008C   /*!< Invalid Attribute value for Local Resource Access Filtering */

#define RCC_LOCALRES_ATTR_CID_TYPE_Pos      (0U)
#define RCC_LOCALRES_ATTR_CID_TYPE_Msk      (0x3UL << RCC_LOCALRES_ATTR_CID_TYPE_Pos)
#define RCC_LOCALRES_ATTR_STATIC_CID_Pos    (4U)
#define RCC_LOCALRES_ATTR_STATIC_CID_Msk    (0x7UL << RCC_LOCALRES_ATTR_STATIC_CID_Pos)
#define RCC_LOCALRES_ATTR_PRIV_Pos          (8U)
#define RCC_LOCALRES_ATTR_PRIV_Msk          (0xFUL << RCC_LOCALRES_ATTR_PRIV_Pos)
#define RCC_LOCALRES_ATTR_SEC_Pos           (12U)
#define RCC_LOCALRES_ATTR_SEC_Msk           (0xFUL << RCC_LOCALRES_ATTR_SEC_Pos)
#define RCC_LOCALRES_ATTR_DYNAMIC_CID_Pos   (16U)
#define RCC_LOCALRES_ATTR_DYNAMIC_CID_Msk   (0xFFUL << RCC_LOCALRES_ATTR_DYNAMIC_CID_Pos)
#define RCC_LOCALRES_ATTR_LOCK_Pos          (24U)
#define RCC_LOCALRES_ATTR_LOCK_Msk          (0xFFUL << RCC_LOCALRES_ATTR_LOCK_Pos)
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup RCC_HAL_RIF_Exported_Macros RCC HAL RIF Exported Macros
  * @{
  */
#define IS_LOCALRES_INDEX(INDEX) (((INDEX) >= RCC_LOCALRES_0) && \
                                  ((INDEX) <= RCC_LOCALRES_113))

/* On secure Cortex core only : */
#if defined(CORTEX_IN_SECURE_STATE)
#define IS_PRIV_ATTRIBUTE(ATTRIBUTE) (((ATTRIBUTE) == RCC_LOCALRES_PRIV)   || \
                                      ((ATTRIBUTE) == RCC_LOCALRES_NOPRIV) || \
                                      ((ATTRIBUTE) == RCC_LOCALRES_ATTR_NONE))

#define IS_LOCK_ATTRIBUTE(ATTRIBUTE) (((ATTRIBUTE) == RCC_LOCALRES_LOCKED) || \
                                      ((ATTRIBUTE) == RCC_LOCALRES_ATTR_NONE))

#define IS_SEC_ATTRIBUTE(ATTRIBUTE) (((ATTRIBUTE) == RCC_LOCALRES_SEC)   || \
                                     ((ATTRIBUTE) == RCC_LOCALRES_NOSEC) || \
                                     ((ATTRIBUTE) == RCC_LOCALRES_ATTR_NONE))

#define IS_CID_ATTRIBUTE(ATTRIBUTE) (((ATTRIBUTE) == RCC_LOCALRES_CID_TYPE_NONE) || \
                                     ((((ATTRIBUTE) & RCC_LOCALRES_ATTR_CID_TYPE_Msk) == RCC_LOCALRES_CID_TYPE_STATIC) \
                                      && ((~(ATTRIBUTE) & ~RCC_LOCALRES_CID_STATIC_Msk) == ~RCC_LOCALRES_CID_STATIC_Msk)) || \
                                     ((((ATTRIBUTE) & RCC_LOCALRES_ATTR_CID_TYPE_Msk) == RCC_LOCALRES_CID_TYPE_DYNAMIC) \
                                      && ((~(ATTRIBUTE) & ~RCC_LOCALRES_CID_DYNAMIC_Msk) == ~RCC_LOCALRES_CID_DYNAMIC_Msk)) )
#endif /* defined(CORTEX_IN_SECURE_STATE) */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_HAL_RIF_Exported_Functions RCC HAL RIF Exported Functions
  * @{
  */

/** @defgroup RCC_HAL_EF_RIF RCC HAL RIF
  * @brief RCC HAL RIF module driver
  * @{
  */
/* On secure Cortex core only : */
#if defined(CORTEX_IN_SECURE_STATE)
HAL_StatusTypeDef HAL_RCC_ConfigAttributes(uint32_t LocalResIndex, uint32_t LocalResAttributes);
#endif /* defined(CORTEX_IN_SECURE_STATE) */

HAL_StatusTypeDef HAL_RCC_GetConfigAttributes(uint32_t LocalResIndex, uint32_t *pLocalResAttributes);
HAL_StatusTypeDef HAL_RCC_TakeLocalResSemaphore(uint32_t LocalResIndex);
HAL_StatusTypeDef HAL_RCC_ReleaseLocalResSemaphore(uint32_t LocalResIndex);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
/******************************************************************************/

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_HAL_RCC_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
